#pragma GCC diagnostic push
#include <nk/transport.h>
#include <nk/types.h>
#ifndef ____SInt64__RAWTYPE__
#define ____SInt64__RAWTYPE__
nk_static_assert(sizeof(nk_sint64_t) == 8, bad_nk_sint64_t_size);
nk_static_assert(nk_alignof(nk_sint64_t) == 8, bad_nk_sint64_t_align);
#endif /* ____SInt64__RAWTYPE__ */

#ifndef ____UInt8__RAWTYPE__
#define ____UInt8__RAWTYPE__
nk_static_assert(sizeof(nk_uint8_t) == 1, bad_nk_uint8_t_size);
nk_static_assert(nk_alignof(nk_uint8_t) == 1, bad_nk_uint8_t_align);
#endif /* ____UInt8__RAWTYPE__ */

#ifndef ____SInt32__RAWTYPE__
#define ____SInt32__RAWTYPE__
nk_static_assert(sizeof(nk_sint32_t) == 4, bad_nk_sint32_t_size);
nk_static_assert(nk_alignof(nk_sint32_t) == 4, bad_nk_sint32_t_align);
#endif /* ____SInt32__RAWTYPE__ */

#ifndef ____UInt64__RAWTYPE__
#define ____UInt64__RAWTYPE__
nk_static_assert(sizeof(nk_uint64_t) == 8, bad_nk_uint64_t_size);
nk_static_assert(nk_alignof(nk_uint64_t) == 8, bad_nk_uint64_t_align);
#endif /* ____UInt64__RAWTYPE__ */

#ifndef ____UInt32__RAWTYPE__
#define ____UInt32__RAWTYPE__
nk_static_assert(sizeof(nk_uint32_t) == 4, bad_nk_uint32_t_size);
nk_static_assert(nk_alignof(nk_uint32_t) == 4, bad_nk_uint32_t_align);
#endif /* ____UInt32__RAWTYPE__ */

#ifndef __kl_VfsTypes__VfsProtoentT__STRUCT__
#define __kl_VfsTypes__VfsProtoentT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsProtoentT {
            __nk_alignas(4) nk_ptr_t name;
            __nk_alignas(4) nk_ptr_t aliases;
            __nk_alignas(4) nk_sint32_t proto;
        } kl_VfsTypes_VfsProtoentT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsProtoentT kl_VfsTypes_VfsProtoentT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsProtoentT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsTimespecT__STRUCT__
#define __kl_VfsTypes__VfsTimespecT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsTimespecT {
            __nk_alignas(8) nk_sint64_t tvSec;
            __nk_alignas(8) nk_sint64_t tvNsec;
        } kl_VfsTypes_VfsTimespecT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsTimespecT kl_VfsTypes_VfsTimespecT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsTimespecT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsStatT__STRUCT__
#define __kl_VfsTypes__VfsStatT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsStatT {
            __nk_alignas(8) nk_uint64_t stDev;
            __nk_alignas(8) nk_uint64_t stIno;
            __nk_alignas(8) nk_uint64_t stMode;
            __nk_alignas(4) nk_uint32_t stNlink;
            __nk_alignas(4) nk_uint32_t stUid;
            __nk_alignas(4) nk_uint32_t stGid;
            __nk_alignas(8) nk_uint64_t stRdev;
            __nk_alignas(8) nk_sint64_t stSize;
            __nk_alignas(8) nk_sint64_t stBlksize;
            __nk_alignas(8) nk_sint64_t stBlocks;
            __nk_alignas(8)
            struct kl_VfsTypes_VfsTimespecT stAtm;
            __nk_alignas(8)
            struct kl_VfsTypes_VfsTimespecT stMtm;
            __nk_alignas(8)
            struct kl_VfsTypes_VfsTimespecT stCtm;
            __nk_alignas(8)
            struct kl_VfsTypes_VfsTimespecT stBtm;
        } kl_VfsTypes_VfsStatT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsStatT kl_VfsTypes_VfsStatT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsStatT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsStatVfsT__STRUCT__
#define __kl_VfsTypes__VfsStatVfsT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsStatVfsT {
            __nk_alignas(8) nk_uint64_t fBsize;
            __nk_alignas(8) nk_uint64_t fFrsize;
            __nk_alignas(8) nk_uint64_t fBlocks;
            __nk_alignas(8) nk_uint64_t fBfree;
            __nk_alignas(8) nk_uint64_t fBavail;
            __nk_alignas(8) nk_uint64_t fFiles;
            __nk_alignas(8) nk_uint64_t fFfree;
            __nk_alignas(8) nk_uint64_t fFavail;
            __nk_alignas(8) nk_uint64_t fFsid;
            __nk_alignas(8) nk_uint64_t fFlag;
            __nk_alignas(8) nk_uint64_t fNamemax;
        } kl_VfsTypes_VfsStatVfsT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsStatVfsT kl_VfsTypes_VfsStatVfsT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsStatVfsT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsIovecT__STRUCT__
#define __kl_VfsTypes__VfsIovecT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsIovecT {
            __nk_alignas(4) nk_ptr_t iovData;
        } kl_VfsTypes_VfsIovecT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsIovecT kl_VfsTypes_VfsIovecT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsIovecT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsMsghdrT__STRUCT__
#define __kl_VfsTypes__VfsMsghdrT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsMsghdrT {
            __nk_alignas(4) nk_ptr_t msgName;
            __nk_alignas(4) nk_ptr_t msgIovs;
            __nk_alignas(4) nk_ptr_t msgData;
            __nk_alignas(4) nk_sint32_t msgFlags;
        } kl_VfsTypes_VfsMsghdrT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsMsghdrT kl_VfsTypes_VfsMsghdrT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsMsghdrT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsNetentT__STRUCT__
#define __kl_VfsTypes__VfsNetentT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsNetentT {
            __nk_alignas(4) nk_ptr_t name;
            __nk_alignas(4) nk_ptr_t aliases;
            __nk_alignas(4) nk_sint32_t addrtype;
            __nk_alignas(4) nk_uint32_t net;
        } kl_VfsTypes_VfsNetentT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsNetentT kl_VfsTypes_VfsNetentT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsNetentT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsIfAddrT__STRUCT__
#define __kl_VfsTypes__VfsIfAddrT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsIfAddrT {
            __nk_alignas(4) nk_ptr_t ifaName;
            __nk_alignas(4) nk_uint32_t ifaFlags;
            __nk_alignas(4) nk_ptr_t ifaAddr;
            __nk_alignas(4) nk_ptr_t ifaNetmask;
            __nk_alignas(4) nk_ptr_t ifaDstaddr;
        } kl_VfsTypes_VfsIfAddrT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsIfAddrT kl_VfsTypes_VfsIfAddrT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsIfAddrT__STRUCT__ */

#ifndef ____UInt16__RAWTYPE__
#define ____UInt16__RAWTYPE__
nk_static_assert(sizeof(nk_uint16_t) == 2, bad_nk_uint16_t_size);
nk_static_assert(nk_alignof(nk_uint16_t) == 2, bad_nk_uint16_t_align);
#endif /* ____UInt16__RAWTYPE__ */

#ifndef __kl_VfsTypes__VfsNpfEntT__STRUCT__
#define __kl_VfsTypes__VfsNpfEntT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsNpfEntT {
            __nk_alignas(4) nk_ptr_t addr;
            __nk_alignas(1) nk_uint8_t mask;
        } kl_VfsTypes_VfsNpfEntT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsNpfEntT kl_VfsTypes_VfsNpfEntT
#endif /* NK_USE_UNQUALIFIED_NAMES */
#endif /* __kl_VfsTypes__VfsNpfEntT__STRUCT__ */

#ifndef __kl_VfsTypes__VfsNpfTableEntT__STRUCT__
#define __kl_VfsTypes__VfsNpfTableEntT__STRUCT__
typedef struct __nk_packed kl_VfsTypes_VfsNpfTableEntT {
            __nk_alignas(1) nk_uint8_t nctCmd;
            __nk_alignas(4) nk_ptr_t nctName;
            __nk_alignas(4)
            struct kl_VfsTypes_VfsNpfEntT nctEnt;
        } kl_VfsTypes_VfsNpfTableEntT;
#ifdef NK_USE_UNQUALIFIED_NAMES
#define VfsTypes_VfsNpfTableEntT kl_VfsTypes_VfsNpfTableEntT
